# Конфигурация Telegram и каналов

api_id = 23247724
api_hash = '3cc500af4e4261a9e8d4545ba6b2448e'
bot_token = '8309282218:AAEm05CWWPobe8ZfT0onXX1FGy66pP--YYg'



# ID владельца и канал для публикаций
owner_id = 398958635
target_channel = '@bonuslab_ru'

# Каналы, которые парсим
channels_to_parse = [
    '@big_bonus_wb',
    '@Big_Bonuss',
    '@dengivshapke',
    '@ishopper',
    '@skidki',
    '@alikzbs_aliexpress',
    '@ozon_skidky',
    '@AleajdaTest',
    '@tanjarus',
    '@wowskidka1',
    '@skidki_piter_moskva',
    '@aliexpress_myskidka',
    '@otkyda_cwb',
    '@burostyle',
    '@nedorogo_na_wb',
    '@wbrchik',
    '@skidkarai',
    '@wb_skidkamam',
]

# Фразы, которые нужно вырезать из текста
blacklist_words = [
    '💝 Скидочный бот',
    'http://t.me/Besplatno_skidki_bot',
    '🎁 @skidki',
    'Скидочный бот',
    '@Ozon_skidky',
    '💝 Скидочный бот (http://t.me/Besplatno_skidki_bot)',
    'Секретные находки➡️@TANJARUS',
    'Секретные находки',
    '@TANJARUS',
    'подписаться | откуда? с вб',
    'подписаться | откуда? с вб (https://t.me/+zBln_Toslek2N2Iy)',
    '✅ Больше находок wb с артикулами тут  (https://t.me/burostyle)',
    '✅ Больше находок wb с артикулами тут',
    'Больше находок wb с артикулами тут',
    'Недорогой WB и OZON (https://t.me/+39v8PiWvXKQxOTI6)',
    'Недорогой WB и OZON',
    'Секретные находки➡️',
    '@TANJARUS'
]



# Режимы работы
AUTO_MODE = True  # если True — посты публикуются без проверки владельцем

# Стоп-слова: если одно из них встречается в тексте поста — он автоматически отклоняется
STOP_WORDS = [
    'казино', 'ставки', '1win', 'вулкан', 'крипта', 'ставь', 'бесплатные деньги', 'реклама', 'Youtube', 'TikTok', 'VK', 'Конкурс', 'конкурс'
]
